//наполнение базы тестовыми данными пользуясь оператором "Insert";

INSERT INTO "Employee"("FirstName", "LastName", "Patronymic", "Passport", "Phone", "BirthDate", "Bonus", "Id", "Contract", "Salary")
VALUES
('Артур', 'Заносьев', 'Дмитриевич', 000001, 077865124, '1901-06-11', 0, '2938c28b-5712-4fc0-8d92-3b92406721c3', '', 1500),
('Никита', 'Лебедев', 'Иванович', 000002, 077865121, '2001-01-21', 20, '2138c28b-5712-4fc0-8d92-3b92406721c3', '', 2000),
('Александр', 'Наумов', 'Станиславович', 000003, 077865122, '2000-02-01', 11, '1938c28b-5712-4fc0-8d92-3b92406721c3', '', 4000),
('Майкл', 'Паламарчук', 'Вячеславович', 000004, 077865123, '2001-06-11', 15, '3938c28b-5712-4fc0-8d92-3b92406721c3', '', 4000),
('Савелий', 'Бондарь', 'Васильевич', 000005, 077865125, '2003-06-05', 100, '2978c28b-5712-4fc0-8d92-3b92406721c3', '', 4500),
('Роман', 'Ботнарь', 'Данилович', 000006, 077865126, '2001-06-11', 1, '2938c28c-5712-4fc0-8d92-3b92406721c3', '', 5000),
('Василий', 'Богорош', 'Григорьевич', 000007, 0778651247, '1951-09-15', 0, '2998c28b-5712-4fc0-8d92-3b92406721c3', '', 6000),
('Дмитрий', 'Ганенко', 'Анатольевич', 000008, 077865124, '2001-06-11', 30, '2948c28b-5712-4fc0-8d92-3b92406721c3', '', 3000);

//провести выборки клиентов, у которых сумма на счету ниже
определенного значения, отсортированных в порядке возрастания суммы;

SELECT *
FROM "Account"
WHERE "Amount" < 1000;

//провести поиск клиента с минимальной суммой на счете

SELECT "Id", MIN("Amount")
FROM "Account"
WHERE "Amount" IN (SELECT MIN("Amount")
       FROM "Account")
group by "Id";

// провести подсчет суммы денег у всех клиентов банка

SELECT SUM("Amount")
FROM "Account";

// с помощью оператора Join, получить выборку банковских счетов и
их владельцев;

SELECT a."Id", c."FirstName", c."LastName", c."Patronymic", a."CurrencyName", a."Amount"
FROM "Account" a INNER JOIN "Client" c ON a."Id" = c."Id";

//вывести клиентов от самых старших к самым младшим;

SELECT *
FROM "Client"
ORDER BY "BirthDate";

//подсчитать количество человек, у которых одинаковый возраст;

SELECT "BirthDate", COUNT("BirthDate") AS br
FROM "Client"
GROUP BY "BirthDate";

// сгруппировать клиентов банка по возрасту;

SELECT "BirthDate"
FROM "Client"
GROUP BY "BirthDate";

// вывести только N человек из таблицы

SELECT *
FROM "Client"
LIMIT 5;
